In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
SOMTO = {"Surname":["Okon","Osuji","Barry",np.nan,np.nan,"Amara","Jack","Fubara"],
         "FirstName":["Julius","Joy","Emeka","Simi","Pascal","Timi","Anslem","Grace"],
         "Weight":[60,72,85,np.nan,63,75,73,np.nan],
         "Height":[5.4,np.nan,np.nan,6.1,6.2,5.8,5.5,np.nan]}

In [4]:
df =pd.DataFrame(SOMTO)

In [5]:
print(df)

  Surname FirstName  Weight  Height
0    Okon    Julius    60.0     5.4
1   Osuji       Joy    72.0     NaN
2   Barry     Emeka    85.0     NaN
3     NaN      Simi     NaN     6.1
4     NaN    Pascal    63.0     6.2
5   Amara      Timi    75.0     5.8
6    Jack    Anslem    73.0     5.5
7  Fubara     Grace     NaN     NaN

In [8]:
#SHOWING AREAS WITH MISSING VALUES
print(df.isna())

   Surname  FirstName  Weight  Height
0    False      False   False   False
1    False      False   False    True
2    False      False   False    True
3     True      False    True   False
4     True      False   False   False
5    False      False   False   False
6    False      False   False   False
7    False      False    True    True

In [7]:
#COUNTING THE TOTAL MISSING VALUES
print(df.isnull().sum())

Surname      2
FirstName    0
Weight       2
Height       3
dtype: int64

In [9]:
#METHOD;FILLING THE MISSING VALUES WITH ZERO
df_filled_zero = df.fillna(0)

In [10]:
print(df_filled_zero)

  Surname FirstName  Weight  Height
0    Okon    Julius    60.0     5.4
1   Osuji       Joy    72.0     0.0
2   Barry     Emeka    85.0     0.0
3       0      Simi     0.0     6.1
4       0    Pascal    63.0     6.2
5   Amara      Timi    75.0     5.8
6    Jack    Anslem    73.0     5.5
7  Fubara     Grace     0.0     0.0

In [22]:
#METHOD 4;FORWARD FILLING
df.ffill()

  Surname FirstName  Weight  Height
0    Okon    Julius    60.0     5.4
1   Osuji       Joy    72.0     5.4
2   Barry     Emeka    85.0     5.4
3   Barry      Simi    85.0     6.1
4   Barry    Pascal    63.0     6.2
5   Amara      Timi    75.0     5.8
6    Jack    Anslem    73.0     5.5
7  Fubara     Grace    73.0     5.5

In [23]:
df['Weight'] = df['Weight'].interpolate()
print(df)

  Surname FirstName  Weight  Height
0    Okon    Julius    60.0     5.4
1   Osuji       Joy    72.0     NaN
2   Barry     Emeka    85.0     NaN
3     NaN      Simi    74.0     6.1
4     NaN    Pascal    63.0     6.2
5   Amara      Timi    75.0     5.8
6    Jack    Anslem    73.0     5.5
7  Fubara     Grace    73.0     NaN

In [25]:
df['Height'] = df['Height'].interpolate()
print(df)

  Surname FirstName  Weight    Height
0    Okon    Julius    60.0  5.400000
1   Osuji       Joy    72.0  5.633333
2   Barry     Emeka    85.0  5.866667
3     NaN      Simi    74.0  6.100000
4     NaN    Pascal    63.0  6.200000
5   Amara      Timi    75.0  5.800000
6    Jack    Anslem    73.0  5.500000
7  Fubara     Grace    73.0  5.500000

In [27]:
df.bfill()

  Surname FirstName  Weight    Height
0    Okon    Julius    60.0  5.400000
1   Osuji       Joy    72.0  5.633333
2   Barry     Emeka    85.0  5.866667
3   Amara      Simi    74.0  6.100000
4   Amara    Pascal    63.0  6.200000
5   Amara      Timi    75.0  5.800000
6    Jack    Anslem    73.0  5.500000
7  Fubara     Grace    73.0  5.500000